
#include "basic_tool.h"
#include "math.h"


uint16_t crc16_check(uint8_t *data, uint16_t length)
{
   uint16_t crc = 0xFFFF;

  for (uint16_t i = 0; i < length; i++) {
    crc ^= (uint16_t)data[i];

    for (uint8_t j = 0; j < 8; j++) {
      if (crc & 0x0001) {
        crc >>= 1;
        crc ^= 0xA001;
      } else {
        crc >>= 1;
      }
    }
  }

  return crc;
}

uint8_t xor_check(uint8_t *data, uint16_t length) 
{
  uint8_t xor_data = 0;
      for (uint8_t i = 0; i < length; i++) {
        xor_data ^= data[i];
    }

    return xor_data;
}

uint8_t sum_check(uint8_t *data, uint16_t length) 
{
  uint8_t sum_data = 0;
      for (uint8_t i = 0; i < length; i++)
	  {
        sum_data += data[i];
    }

    return sum_data;
}


float Compute_Angle(float x,float y)//ÊäÈë x y ×ø±ê£¬·µ»Ø½Ç¶ÈÖµ
{
	return atan2(x,y); 	
}


static const uint8_t s_CRCHi[] = {
    0x00, 0xC1, 0x81, 0x40, 0x01, 0xC0, 0x80, 0x41, 0x01, 0xC0,
    0x80, 0x41, 0x00, 0xC1, 0x81, 0x40, 0x01, 0xC0, 0x80, 0x41,
    0x00, 0xC1, 0x81, 0x40, 0x00, 0xC1, 0x81, 0x40, 0x01, 0xC0,
    0x80, 0x41, 0x01, 0xC0, 0x80, 0x41, 0x00, 0xC1, 0x81, 0x40,
    0x00, 0xC1, 0x81, 0x40, 0x01, 0xC0, 0x80, 0x41, 0x00, 0xC1,
    0x81, 0x40, 0x01, 0xC0, 0x80, 0x41, 0x01, 0xC0, 0x80, 0x41,
    0x00, 0xC1, 0x81, 0x40, 0x01, 0xC0, 0x80, 0x41, 0x00, 0xC1,
    0x81, 0x40, 0x00, 0xC1, 0x81, 0x40, 0x01, 0xC0, 0x80, 0x41,
    0x00, 0xC1, 0x81, 0x40, 0x01, 0xC0, 0x80, 0x41, 0x01, 0xC0,
    0x80, 0x41, 0x00, 0xC1, 0x81, 0x40, 0x00, 0xC1, 0x81, 0x40,
    0x01, 0xC0, 0x80, 0x41, 0x01, 0xC0, 0x80, 0x41, 0x00, 0xC1,
    0x81, 0x40, 0x01, 0xC0, 0x80, 0x41, 0x00, 0xC1, 0x81, 0x40,
    0x00, 0xC1, 0x81, 0x40, 0x01, 0xC0, 0x80, 0x41, 0x01, 0xC0,
    0x80, 0x41, 0x00, 0xC1, 0x81, 0x40, 0x00, 0xC1, 0x81, 0x40,
    0x01, 0xC0, 0x80, 0x41, 0x00, 0xC1, 0x81, 0x40, 0x01, 0xC0,
    0x80, 0x41, 0x01, 0xC0, 0x80, 0x41, 0x00, 0xC1, 0x81, 0x40,
    0x00, 0xC1, 0x81, 0x40, 0x01, 0xC0, 0x80, 0x41, 0x01, 0xC0,
    0x80, 0x41, 0x00, 0xC1, 0x81, 0x40, 0x01, 0xC0, 0x80, 0x41,
    0x00, 0xC1, 0x81, 0x40, 0x00, 0xC1, 0x81, 0x40, 0x01, 0xC0,
    0x80, 0x41, 0x00, 0xC1, 0x81, 0x40, 0x01, 0xC0, 0x80, 0x41,
    0x01, 0xC0, 0x80, 0x41, 0x00, 0xC1, 0x81, 0x40, 0x01, 0xC0,
    0x80, 0x41, 0x00, 0xC1, 0x81, 0x40, 0x00, 0xC1, 0x81, 0x40,
    0x01, 0xC0, 0x80, 0x41, 0x01, 0xC0, 0x80, 0x41, 0x00, 0xC1,
    0x81, 0x40, 0x00, 0xC1, 0x81, 0x40, 0x01, 0xC0, 0x80, 0x41,
    0x00, 0xC1, 0x81, 0x40, 0x01, 0xC0, 0x80, 0x41, 0x01, 0xC0,
    0x80, 0x41, 0x00, 0xC1, 0x81, 0x40
} ;
// CRC µÍÎ»×Ö½ÚÖµ±í
const uint8_t s_CRCLo[] = {
	0x00, 0xC0, 0xC1, 0x01, 0xC3, 0x03, 0x02, 0xC2, 0xC6, 0x06,
	0x07, 0xC7, 0x05, 0xC5, 0xC4, 0x04, 0xCC, 0x0C, 0x0D, 0xCD,
	0x0F, 0xCF, 0xCE, 0x0E, 0x0A, 0xCA, 0xCB, 0x0B, 0xC9, 0x09,
	0x08, 0xC8, 0xD8, 0x18, 0x19, 0xD9, 0x1B, 0xDB, 0xDA, 0x1A,
	0x1E, 0xDE, 0xDF, 0x1F, 0xDD, 0x1D, 0x1C, 0xDC, 0x14, 0xD4,
	0xD5, 0x15, 0xD7, 0x17, 0x16, 0xD6, 0xD2, 0x12, 0x13, 0xD3,
	0x11, 0xD1, 0xD0, 0x10, 0xF0, 0x30, 0x31, 0xF1, 0x33, 0xF3,
	0xF2, 0x32, 0x36, 0xF6, 0xF7, 0x37, 0xF5, 0x35, 0x34, 0xF4,
	0x3C, 0xFC, 0xFD, 0x3D, 0xFF, 0x3F, 0x3E, 0xFE, 0xFA, 0x3A,
	0x3B, 0xFB, 0x39, 0xF9, 0xF8, 0x38, 0x28, 0xE8, 0xE9, 0x29,
	0xEB, 0x2B, 0x2A, 0xEA, 0xEE, 0x2E, 0x2F, 0xEF, 0x2D, 0xED,
	0xEC, 0x2C, 0xE4, 0x24, 0x25, 0xE5, 0x27, 0xE7, 0xE6, 0x26,
	0x22, 0xE2, 0xE3, 0x23, 0xE1, 0x21, 0x20, 0xE0, 0xA0, 0x60,
	0x61, 0xA1, 0x63, 0xA3, 0xA2, 0x62, 0x66, 0xA6, 0xA7, 0x67,
	0xA5, 0x65, 0x64, 0xA4, 0x6C, 0xAC, 0xAD, 0x6D, 0xAF, 0x6F,
	0x6E, 0xAE, 0xAA, 0x6A, 0x6B, 0xAB, 0x69, 0xA9, 0xA8, 0x68,
	0x78, 0xB8, 0xB9, 0x79, 0xBB, 0x7B, 0x7A, 0xBA, 0xBE, 0x7E,
	0x7F, 0xBF, 0x7D, 0xBD, 0xBC, 0x7C, 0xB4, 0x74, 0x75, 0xB5,
	0x77, 0xB7, 0xB6, 0x76, 0x72, 0xB2, 0xB3, 0x73, 0xB1, 0x71,
	0x70, 0xB0, 0x50, 0x90, 0x91, 0x51, 0x93, 0x53, 0x52, 0x92,
	0x96, 0x56, 0x57, 0x97, 0x55, 0x95, 0x94, 0x54, 0x9C, 0x5C,
	0x5D, 0x9D, 0x5F, 0x9F, 0x9E, 0x5E, 0x5A, 0x9A, 0x9B, 0x5B,
	0x99, 0x59, 0x58, 0x98, 0x88, 0x48, 0x49, 0x89, 0x4B, 0x8B,
	0x8A, 0x4A, 0x4E, 0x8E, 0x8F, 0x4F, 0x8D, 0x4D, 0x4C, 0x8C,
	0x44, 0x84, 0x85, 0x45, 0x87, 0x47, 0x46, 0x86, 0x82, 0x42,
	0x43, 0x83, 0x41, 0x81, 0x80, 0x40
};

/*
*********************************************************************************************************
*	º¯ Êý Ãû: str_len
*	¹¦ÄÜËµÃ÷: ¼ÆËã×Ö·û´®³¤¶È.0ÊÇ½áÊø·û
*	ÐÎ    ²Î: _str : »º³åÇø
*	·µ »Ø Öµ: ÎÞ
*********************************************************************************************************
*/
int str_len(char *_str)
{
	int len = 0;

	while (*_str++) len++;
	return len;
}

/*
*********************************************************************************************************
*	º¯ Êý Ãû: str_cpy
*	¹¦ÄÜËµÃ÷: ¸´ÖÆ×Ö·û´®
*	ÐÎ    ²Î: tar : Ä¿±ê»º³åÇø
*			 src : Ô´»º³åÇø
*	·µ »Ø Öµ: ÎÞ
*********************************************************************************************************
*/
void str_cpy(char *_tar, char *_src)
{
	do
	{
		*_tar++ = *_src;
	}
	while (*_src++);
}

/*
*********************************************************************************************************
*	º¯ Êý Ãû: str_cmp
*	¹¦ÄÜËµÃ÷: ×Ö·û´®±È½Ï
*	ÐÎ    ²Î: s1 : ×Ö·û´®1
*			  s2 : ×Ö·û´®2
*	·µ »Ø Öµ: 0 ±íÊ¾ÏàµÈ ·Ç0±íÊ¾²»µÈ
*********************************************************************************************************
*/
int str_cmp(char * s1, char * s2)
{
	while ((*s1!=0) && (*s2!=0) && (*s1==*s2))
	{
		s1++;
		s2++;
	}
	return *s1 - *s2;
}

/*
*********************************************************************************************************
*	º¯ Êý Ãû: str_copy
*	¹¦ÄÜËµÃ÷: ¸´ÖÆ×Ö·û´®
*	ÐÎ    ²Î: tar : Ä¿±ê»º³åÇø
*			 src : Ô´»º³åÇø
*	·µ »Ø Öµ: ÎÞ
*********************************************************************************************************
*/
void mem_set(char *_tar, char _data, int _len)
{
	while (_len--)
	{
		*_tar++ = _data;
	}
}

/*
*********************************************************************************************************
*	º¯ Êý Ãû: int_to_ascii
*	¹¦ÄÜËµÃ÷: ½«ÕûÊý×ª»»ÎªASCIIÊý×é¡£Ö§³Ö¸ºÊý¡£
*	ÐÎ    ²Î: _Number : ÕûÊý
*			 _pBuf : Ä¿±ê»º³åÇø, ´æ·Å×ª»»ºóµÄ½á¹û¡£ÒÔ0½áÊøµÄ×Ö·û´®¡£
*			 _len : ASCII×Ö·û¸öÊý, ×Ö·û´®³¤¶È
*	·µ »Ø Öµ: ÎÞ
*********************************************************************************************************
*/
void int_to_str(int _iNumber, char *_pBuf, unsigned char _len)
{
	unsigned char i;
	int iTemp;

	if (_iNumber < 0)	/* ¸ºÊý */
	{
		iTemp = -_iNumber;	/* ×ªÎªÕýÊý */
	}
	else
	{
		iTemp = _iNumber;
	}

	mem_set(_pBuf, ' ',_len);

	/* ½«ÕûÊý×ª»»ÎªASCII×Ö·û´® */
	for (i = 0; i < _len; i++)
	{
		_pBuf[_len - 1 - i] = (iTemp % 10) + '0';
		iTemp = iTemp / 10;
		if (iTemp == 0)
		{
			break;
		}
	}
	_pBuf[_len] = 0;

	if (_iNumber < 0)	/* ¸ºÊý */
	{
		for (i = 0; i < _len; i++)
		{
			if ((_pBuf[i] == ' ') && (_pBuf[i + 1] != ' '))
			{
				_pBuf[i] = '-';
				break;
			}
		}
	}
}

/*
*********************************************************************************************************
*	º¯ Êý Ãû: str_to_int
*	¹¦ÄÜËµÃ÷: ½«ASCIIÂë×Ö·û´®×ª»»³ÉÕûÊý¡£ Óöµ½Ð¡Êýµã×Ô¶¯Ô½¹ý¡£
*	ÐÎ    ²Î: _pStr :´ý×ª»»µÄASCIIÂë´®. ¿ÉÒÔÒÔ¶ººÅ£¬#»ò0½áÊø¡£ 2014-06-20 ÐÞ¸ÄÎª·Ç0-9µÄ×Ö·û¡£
*	·µ »Ø Öµ: ¶þ½øÖÆÕûÊýÖµ
*********************************************************************************************************
*/
int str_to_int(char *_pStr)
{
	unsigned char flag;
	char *p;
	int ulInt;
	unsigned char  i;
	unsigned char  ucTemp;

	p = _pStr;
	if (*p == '-')
	{
		flag = 1;	/* ¸ºÊý */
		p++;
	}
	else
	{
		flag = 0;
	}

	ulInt = 0;
	for (i = 0; i < 15; i++)
	{
		ucTemp = *p;
		if (ucTemp == '.')	/* Óöµ½Ð¡Êýµã£¬×Ô¶¯Ìø¹ý1¸ö×Ö½Ú */
		{
			p++;
			ucTemp = *p;
		}
		if ((ucTemp >= '0') && (ucTemp <= '9'))
		{
			ulInt = ulInt * 10 + (ucTemp - '0');
			p++;
		}
		else
		{
			break;
		}
	}

	if (flag == 1)
	{
		return -ulInt;
	}
	return ulInt;
}

/*
*********************************************************************************************************
*	º¯ Êý Ãû: BEBufToUint16
*	¹¦ÄÜËµÃ÷: ½«2×Ö½ÚÊý×é(´ó¶ËBig Endian´ÎÐò£¬¸ß×Ö½ÚÔÚÇ°)×ª»»Îª16Î»ÕûÊý
*	ÐÎ    ²Î: _pBuf : Êý×é
*	·µ »Ø Öµ: 16Î»ÕûÊýÖµ
*
*   ´ó¶Ë(Big Endian)ÓëÐ¡¶Ë(Little Endian)
*********************************************************************************************************
*/
uint16_t BEBufToUint16(uint8_t *_pBuf)
{
    return (((uint16_t)_pBuf[0] << 8) | _pBuf[1]);
}

/*
*********************************************************************************************************
*	º¯ Êý Ãû: LEBufToUint16
*	¹¦ÄÜËµÃ÷: ½«2×Ö½ÚÊý×é(Ð¡¶ËLittle Endian£¬µÍ×Ö½ÚÔÚÇ°)×ª»»Îª16Î»ÕûÊý
*	ÐÎ    ²Î: _pBuf : Êý×é
*	·µ »Ø Öµ: 16Î»ÕûÊýÖµ
*********************************************************************************************************
*/
uint16_t LEBufToUint16(uint8_t *_pBuf)
{
    return (((uint16_t)_pBuf[1] << 8) | _pBuf[0]);
}


/*
*********************************************************************************************************
*	º¯ Êý Ãû: BEBufToUint32
*	¹¦ÄÜËµÃ÷: ½«4×Ö½ÚÊý×é(´ó¶ËBig Endian´ÎÐò£¬¸ß×Ö½ÚÔÚÇ°)×ª»»Îª16Î»ÕûÊý
*	ÐÎ    ²Î: _pBuf : Êý×é
*	·µ »Ø Öµ: 16Î»ÕûÊýÖµ
*
*   ´ó¶Ë(Big Endian)ÓëÐ¡¶Ë(Little Endian)
*********************************************************************************************************
*/
uint32_t BEBufToUint32(uint8_t *_pBuf)
{
    return (((uint32_t)_pBuf[0] << 24) | ((uint32_t)_pBuf[1] << 16) | ((uint32_t)_pBuf[2] << 8) | _pBuf[3]);
}

/*
*********************************************************************************************************
*	º¯ Êý Ãû: LEBufToUint32
*	¹¦ÄÜËµÃ÷: ½«4×Ö½ÚÊý×é(Ð¡¶ËLittle Endian£¬µÍ×Ö½ÚÔÚÇ°)×ª»»Îª16Î»ÕûÊý
*	ÐÎ    ²Î: _pBuf : Êý×é
*	·µ »Ø Öµ: 16Î»ÕûÊýÖµ
*********************************************************************************************************
*/
uint32_t LEBufToUint32(uint8_t *_pBuf)
{
    return (((uint32_t)_pBuf[3] << 24) | ((uint32_t)_pBuf[2] << 16) | ((uint32_t)_pBuf[1] << 8) | _pBuf[0]);
}

/*
*********************************************************************************************************
*	º¯ Êý Ãû: CRC16_Modbus
*	¹¦ÄÜËµÃ÷: ¼ÆËãCRC¡£ ÓÃÓÚModbusÐ­Òé¡£
*	ÐÎ    ²Î: _pBuf : ²ÎÓëÐ£ÑéµÄÊý¾Ý
*			  _usLen : Êý¾Ý³¤¶È
*	·µ »Ø Öµ: 16Î»ÕûÊýÖµ¡£ ¶ÔÓÚModbus £¬´Ë½á¹û¸ß×Ö½ÚÏÈ´«ËÍ£¬µÍ×Ö½Úºó´«ËÍ¡£
*
*   ËùÓÐ¿ÉÄÜµÄCRCÖµ¶¼±»Ô¤×°ÔÚÁ½¸öÊý×éµ±ÖÐ£¬µ±¼ÆËã±¨ÎÄÄÚÈÝÊ±¿ÉÒÔ¼òµ¥µÄË÷Òý¼´¿É£»
*   Ò»¸öÊý×é°üº¬ÓÐ16Î»CRCÓòµÄËùÓÐ256¸ö¿ÉÄÜµÄ¸ßÎ»×Ö½Ú£¬ÁíÒ»¸öÊý×éº¬ÓÐµÍÎ»×Ö½ÚµÄÖµ£»
*   ÕâÖÖË÷Òý·ÃÎÊCRCµÄ·½Ê½Ìá¹©ÁË±È¶Ô±¨ÎÄ»º³åÇøµÄÃ¿Ò»¸öÐÂ×Ö·û¶¼¼ÆËãÐÂµÄCRC¸ü¿ìµÄ·½·¨£»
*
*  ×¢Òâ£º´Ë³ÌÐòÄÚ²¿Ö´ÐÐ¸ß/µÍCRC×Ö½ÚµÄ½»»»¡£´Ëº¯Êý·µ»ØµÄÊÇÒÑ¾­¾­¹ý½»»»µÄCRCÖµ£»Ò²¾ÍÊÇËµ£¬¸Ãº¯ÊýµÄ·µ»ØÖµ¿ÉÒÔÖ±½Ó·ÅÖÃ
*        ÓÚ±¨ÎÄÓÃÓÚ·¢ËÍ£»
*********************************************************************************************************
*/
uint16_t CRC16_Modbus(uint8_t *_pBuf, uint16_t _usLen)
{
	uint8_t ucCRCHi = 0xFF; /* ¸ßCRC×Ö½Ú³õÊ¼»¯ */
	uint8_t ucCRCLo = 0xFF; /* µÍCRC ×Ö½Ú³õÊ¼»¯ */
	uint16_t usIndex;  /* CRCÑ­»·ÖÐµÄË÷Òý */

    while (_usLen--)
    {
		usIndex = ucCRCHi ^ *_pBuf++; /* ¼ÆËãCRC */
		ucCRCHi = ucCRCLo ^ s_CRCHi[usIndex];
		ucCRCLo = s_CRCLo[usIndex];
    }
    return ((uint16_t)ucCRCHi << 8 | ucCRCLo);
}


/*
*********************************************************************************************************
*	º¯ Êý Ãû: CaculTwoPoint
*	¹¦ÄÜËµÃ÷: ¸ù¾Ý2µãÖ±Ïß·½³Ì£¬¼ÆËãYÖµ
*	ÐÎ    ²Î:  2¸öµãµÄ×ø±êºÍxÊäÈëÁ¿
*	·µ »Ø Öµ: x¶ÔÓ¦µÄyÖµ
*********************************************************************************************************
*/
int32_t  CaculTwoPoint(int32_t x1, int32_t y1, int32_t x2, int32_t y2, int32_t x)
{
	return y1 + ((int64_t)(y2 - y1) * (x - x1)) / (x2 - x1);
}


/*
*********************************************************************************************************
*	º¯ Êý Ãû: BcdToChar
*	¹¦ÄÜËµÃ÷: ½«BCDÂë×ªÎªASCII×Ö·û¡£ ±ÈÈç 0x0A ==> 'A'
*	ÐÎ    ²Î: _bcd   £ºÊäÈëµÄ¶þ½øÖÆÊý¡£±ØÐëÐ¡ÓÚ16
*	·µ »Ø Öµ: ×ª»»½á¹û
*********************************************************************************************************
*/
char BcdToChar(uint8_t _bcd)
{
	if (_bcd < 10)
	{
		return _bcd + '0';
	}
	else if (_bcd < 16)
	{
		return _bcd + 'A';
	}
	else
	{
		return 0;
	}
}

/*
*********************************************************************************************************
*	º¯ Êý Ãû: HexToAscll
*	¹¦ÄÜËµÃ÷: ½«¶þ½øÖÆÊý×é×ª»»Îª16½øÖÆ¸ñÊ½µÄASCII×Ö·û´®¡£Ã¿¸ö2¸öASCII×Ö·ûºó±£Áô1¸ö¿Õ¸ñ¡£
*			  0x12 0x34 ×ª»¯Îª 0x31 0x32 0x20 0x33 0x34 0x00  ¼´ "1234"
*	ÐÎ    ²Î: 	_pHex   £ºÊäÈëµÄÊý¾Ý£¬¶þ½øÖÆÊý×é
*				_pAscii £º´æ·Å×ª»»½á¹û, ASCII×Ö·û´®£¬0½áÊø¡£1¸ö¶þ½øÖÆ¶ÔÓ¦2¸öASCII×Ö·û.
*	·µ »Ø Öµ: ×ª»»µÃµ½µÄÕûÊý
*********************************************************************************************************
*/
void HexToAscll(uint8_t * _pHex, char *_pAscii, uint16_t _BinBytes)
{
	uint16_t i;
	
	if (_BinBytes == 0)
	{
		_pAscii[0] = 0;
	}
	else
	{
		for (i = 0; i < _BinBytes; i++)
		{
			_pAscii[3 * i] = BcdToChar(_pHex[i] >> 4);
			_pAscii[3 * i + 1] = BcdToChar(_pHex[i] & 0x0F);
			_pAscii[3 * i + 2] = ' ';
		}
		_pAscii[3 * (i - 1) + 2] = 0;
	}
}

/*
*********************************************************************************************************
*	º¯ Êý Ãû: AsciiToUint32
*	¹¦ÄÜËµÃ÷: ±ä³¤µÄ ASCII ×Ö·û×ª»»Îª32Î»ÕûÊý  ASCII ×Ö·ûÒÔ¿Õ¸ñ»òÕß0½áÊø ¡£ Ö§³Ö16½øÖÆºÍ10½øÖÆÊäÈë
*	ÐÎ    ²Î: *pAscii £ºÒª×ª»»µÄASCIIÂë
*	·µ »Ø Öµ: ×ª»»µÃµ½µÄÕûÊý
*********************************************************************************************************
*/
uint32_t AsciiToUint32(char *pAscii)
{
	char i;
	char bTemp;
	char bIsHex;
	char bLen;
	char bZeroLen;
	uint32_t lResult;
	uint32_t lBitValue;

	/* ÅÐ¶ÏÊÇ·ñÊÇ16½øÖÆÊý */
	bIsHex = 0;
	if ((pAscii[0] == '0') && ((pAscii[1] == 'x') || (pAscii[1] == 'X')))
	{
		bIsHex=1;
	}

	lResult=0;
	// ×î´óÊýÖµÎª 4294967295, 10Î»+2×Ö·û"0x" //
	if (bIsHex == 0)
	{ // Ê®½øÖÆ //
		// Çó³¤¶È //
		lBitValue=1;

		/* Ç°µ¼È¥0 */
		for (i = 0; i < 8; i++)
		{
			bTemp = pAscii[i];
			if (bTemp != '0')
				break;
		}
		bZeroLen = i;

		for (i = 0; i < 10; i++)
		{
			if ((pAscii[i] < '0') || (pAscii[i] > '9'))
				break;
			lBitValue = lBitValue * 10;
		}
		bLen = i;
		lBitValue = lBitValue / 10;
		if (lBitValue == 0)
			lBitValue=1;
		for (i = bZeroLen; i < bLen; i++)
		{
			lResult += (pAscii[i] - '0') * lBitValue;
			lBitValue /= 10;
		}
	}
	else
	{	/* 16½øÖÆ */
		/* Çó³¤¶È */
		lBitValue=1;

		/* Ç°µ¼È¥0 */
		for (i = 0; i < 8; i++)
		{
			bTemp = pAscii[i + 2];
			if(bTemp!='0')
				break;
		}
		bZeroLen = i;
		for (; i < 8; i++)
		{
			bTemp=pAscii[i+2];
			if (((bTemp >= 'A') && (bTemp <= 'F')) ||
				((bTemp>='a')&&(bTemp<='f')) ||
				((bTemp>='0')&&(bTemp<='9')) )
			{
				lBitValue=lBitValue * 16;
			}
			else
			{
				break;
			}
		}
		lBitValue = lBitValue / 16;
		if (lBitValue == 0)
			lBitValue = 1;
		bLen = i;
		for (i = bZeroLen; i < bLen; i++)
		{
			bTemp = pAscii[i + 2];
			if ((bTemp >= 'A') && (bTemp <= 'F'))
			{
				bTemp -= 0x37;
			}
			else if ((bTemp >= 'a') && (bTemp <= 'f'))
			{
				bTemp -= 0x57;
			}
			else if ((bTemp >= '0') && (bTemp <= '9'))
			{
				bTemp -= '0';
			}
			lResult += bTemp*lBitValue;
			lBitValue /= 16;
		}
	}
	return lResult;
}
